In [1]:
import numpy as np 
import pandas as pd

In [3]:
titanic_train = pd.read_csv("logistic_training_titanic_x_y_train.csv")

In [4]:
titanic_train.head()

,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
0,2,"Weisz, Mrs. Leopold (Mathilde Francoise Pede)",female,29.0,1,0,228414,26.000,NaN,S,1
1,3,"Williams, Mr. Howard Hugh ""Harry""",male,NaN,0,0,A/5 2466,8.050,NaN,S,0
2,2,"Morley, Mr. Henry Samuel (""Mr Henry Marshall"")",male,39.0,0,0,250655,26.000,NaN,S,0
3,3,"Palsson, Mrs. Nils (Alma Cornelia Berglund)",female,29.0,0,4,349909,21.075,NaN,S,0
4,3,"Sutehall, Mr. Henry Jr",male,25.0,0,0,SOTON/OQ 392076,7.050,NaN,S,0

In [5]:
del titanic_train["Name"]
del titanic_train["Ticket"]
del titanic_train["Cabin"]
del titanic_train["Fare"]
titanic_train.head()

   Pclass     Sex   Age  SibSp  Parch Embarked  Survived
0       2  female  29.0      1      0        S         1
1       3    male   NaN      0      0        S         0
2       2    male  39.0      0      0        S         0
3       3  female  29.0      0      4        S         0
4       3    male  25.0      0      0        S         0

In [19]:
titanic_data = titanic_train.iloc[:,0:6]

In [20]:
titanic_data.head()

   Pclass     Sex   Age  SibSp  Parch Embarked
0       2  female  29.0      1      0        S
1       3    male   NaN      0      0        S
2       2    male  39.0      0      0        S
3       3  female  29.0      0      4        S
4       3    male  25.0      0      0        S

In [24]:
titanic_target = titanic_train.iloc[:,6]
titanic_target.head()

0    1
1    0
2    0
3    0
4    0
Name: Survived, dtype: int64

In [25]:
def getNumber(str):
    if str=="male":
        return 1
    else:
        return 2
titanic_data["gender"]=titanic_data["Sex"].apply(getNumber)

In [26]:
def Em(str):
    if str=="S":
        return 1
    else:
        return 2
titanic_data["Embark"]=titanic_data["Embarked"].apply(Em)

In [27]:
del titanic_data["Sex"]
del titanic_data["Embarked"]

In [28]:
titanic_data.head()

   Pclass   Age  SibSp  Parch  gender  Embark
0       2  29.0      1      0       2       1
1       3   NaN      0      0       1       1
2       2  39.0      0      0       1       1
3       3  29.0      0      4       2       1
4       3  25.0      0      0       1       1

In [29]:
meanAge = titanic_data.Age.mean()

In [30]:
titanic_data.Age.fillna(meanAge,inplace=True)

In [31]:
titanic_data.isnull().sum()

Pclass    0
Age       0
SibSp     0
Parch     0
gender    0
Embark    0
dtype: int64

In [32]:
titanic_test = pd.read_csv("logistic_test_titanic_x_test.csv")

In [33]:
titanic_test.head()

,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,2,"Davies, Master. John Morgan Jr",male,8.0,1,1,C.A. 33112,36.7500,NaN,S
1,1,"Leader, Dr. Alice (Farnham)",female,49.0,0,0,17465,25.9292,D17,S
2,3,"Kilgannon, Mr. Thomas J",male,NaN,0,0,36865,7.7375,NaN,Q
3,2,"Jacobsohn, Mrs. Sidney Samuel (Amy Frances Chr...",female,24.0,2,1,243847,27.0000,NaN,S
4,1,"McGough, Mr. James Robert",male,36.0,0,0,PC 17473,26.2875,E25,S

In [37]:
titanic_test.head()

   Pclass     Sex   Age  SibSp  Parch Embarked
0       2    male   8.0      1      1        S
1       1  female  49.0      0      0        S
2       3    male   NaN      0      0        Q
3       2  female  24.0      2      1        S
4       1    male  36.0      0      0        S

In [38]:
def getNumber1(str):
    if str=="male":
        return 1
    else:
        return 2
titanic_test["gender"]=titanic_test["Sex"].apply(getNumber1)

In [39]:
def Em1(str):
    if str=="S":
        return 1
    else:
        return 2
titanic_test["Embark"]=titanic_test["Embarked"].apply(Em1)

In [40]:
del titanic_test["Sex"]
del titanic_test["Embarked"]

In [41]:
titanic_test.head()

   Pclass   Age  SibSp  Parch  gender  Embark
0       2   8.0      1      1       1       1
1       1  49.0      0      0       2       1
2       3   NaN      0      0       1       2
3       2  24.0      2      1       2       1
4       1  36.0      0      0       1       1

In [53]:
meanAge2 = titanic_test.Age.mean()

In [56]:
titanic_test.Age.fillna(meanAge2,inplace=True)

In [57]:
titanic_test.isnull().sum()

Pclass    0
Age       0
SibSp     0
Parch     0
gender    0
Embark    0
dtype: int64

In [58]:
titanic_data.shape

(668, 6)

In [59]:
titanic_test.shape

(223, 6)

In [60]:
titanic_target.shape

(668,)

In [61]:
df1 = titanic_data.as_matrix()
df2 = titanic_target.as_matrix()
df3 = titanic_test.as_matrix()

In [62]:
from sklearn.linear_model import LogisticRegression

In [74]:
alg1 = LogisticRegression(C=0.65)

In [75]:
alg1.fit(df1,df2)

LogisticRegression(C=0.65, class_weight=None, dual=False, fit_intercept=True,
          intercept_scaling=1, max_iter=100, multi_class='ovr', n_jobs=1,
          penalty='l2', random_state=None, solver='liblinear', tol=0.0001,
          verbose=0, warm_start=False)

In [76]:
df4 = alg1.predict(df3)

In [77]:
df4

array([0, 1, 0, 1, 0, 0, 0, 0, 1, 0, 1, 0, 1, 1, 0, 0, 0, 0, 0, 1, 1, 0,
       1, 1, 0, 1, 0, 0, 1, 1, 0, 0, 0, 0, 0, 1, 1, 0, 0, 0, 1, 0, 0, 0,
       1, 1, 0, 1, 0, 0, 0, 1, 1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 1, 1, 1, 0,
       0, 1, 1, 0, 0, 0, 1, 0, 0, 1, 1, 0, 0, 0, 0, 1, 0, 0, 0, 1, 1, 1,
       0, 0, 1, 0, 0, 1, 0, 0, 0, 0, 0, 1, 1, 0, 1, 0, 1, 1, 0, 0, 0, 0,
       0, 1, 1, 0, 1, 0, 0, 1, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 1, 0, 0,
       0, 0, 0, 0, 1, 1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 1, 1, 0, 0, 0,
       1, 0, 0, 1, 0, 0, 0, 1, 1, 1, 1, 0, 1, 0, 1, 1, 1, 1, 1, 0, 1, 0,
       0, 0, 0, 1, 0, 0, 0, 1, 1, 0, 1, 0, 1, 0, 0, 0, 1, 0, 0, 1, 1, 1,
       1, 1, 0, 1, 0, 0, 0, 0, 0, 0, 1, 1, 0, 1, 0, 0, 1, 1, 0, 0, 0, 0,
       1, 0, 0], dtype=int64)

In [78]:
np.savetxt("log_parth123.csv" , df4.astype(int),fmt="%i",delimiter=",")